package RegularExpressions;

import java.util.Scanner;

public class demo {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        // [A-Z] - мачва една буква от А-З
        // [a-z] - мачва една буква от а-з
        // [A-Z]+ - мачва една или повече букви от А-З в даден текс
        // [a-z]+ - мачва една или повече букви от a-z в даден текс
        // [A-Z][a-z]+ - ще мачне една главна буква от А-З и една или повече малки букви от а-з
        // [^abc] - ще намери всички останали букви освен избоените абц
        // [0-9] - ще намери една цифра от 0-9
        // [0-9]+ - ще намери одна или повече цифри в диапазона 0-9
        /*
        предефинирани класове
        \s+
        \S+
        \w+
        \W+
        \d+
        \D+

         */


    }
}
